In [27]:
import pandas as pd

std= pd.DataFrame({
    "StudentID": range(1, 11),
    "Name": ["Alice", "Bob", "Charlie", "None", "Eva", "Frank", "Grace", "Helen", "Ian", "Jane"],
    "Age": [20, 21, 19, 22, 20, 23, 21, 20, 22, 19],
    "Department": ["CS", "IT", "CS", "ECE", "IT", "CS", "ECE", "IT", "CS", "ECE"],
    "Math": [85, 78, 92, 65, 88, 74, 90, 82, 95, 70],
    "Science": [80, 85, 70, 60, 92, 75, 88, 78, 85, 72],
    "English": [75, 88, 82, 70, 85, 80, 90, 86, 84, 73]
})


sls = pd.DataFrame({
    "OrderID": range(101, 111),
    "Product": ["Laptop", "Mobile", "Tablet", "Laptop", "Headphones", "Mobile", "Laptop", "Tablet", "Mobile", "Headphones"],
    "Category": ["Electronics", "Electronics", "Electronics", "Electronics", "Accessories", "Electronics", "Electronics", "Electronics", "Electronics", "Accessories"],
    "Quantity": [2, 5, 3, 1, 10, 4, 2, 6, 7, 8],
    "Price": [60000, 20000, 15000, 62000, 2000, 21000, 61000, 15500, 20500, 2500],
    "Region": ["North", "South", "East", "West", "North", "South", "East", "West", "North","west" ]
})

In [12]:
# # slicing- it is used to specific rows or columns from a dataframe using lable or index

# #how to get first five
# std.head() 

# # how to applly slicing

# # slicing syntax-can do with loc and iloc
# # std[rstart: rend: rstep,cstart:cend:cstep]
# std.iloc[0:3:2]
# std.iloc[3::,0:3]
# std.iloc[::-1,::-1]

   English  Science  Math Department  Age     Name  StudentID
9       73       72    70        ECE   19     Jane         10
8       84       85    95         CS   22      Ian          9
7       86       78    82         IT   20    Helen          8
6       90       88    90        ECE   21    Grace          7
5       80       75    74         CS   23    Frank          6
4       85       92    88         IT   20      Eva          5
3       70       60    65        ECE   22     None          4
2       82       70    92         CS   19  Charlie          3
1       88       85    78         IT   21      Bob          2
0       75       80    85         CS   20    Alice          1

In [30]:
# filtering - getting specific data based on a condition
std['Math']>85

# boolean indexing
std[std['Math']>85]

std[std['Department']=='CS']

# and operator
std[(std['Department']=='CS') & (std['Math']>80)]

# or operator
std[(std['Department']=='CS') | (std['Math']>80)]

# not operator
std[~(std['Department']=='CS') & ~(std['Math']>80)]

(10, 7)

In [39]:
# attributes- it will give you the information of dataframe
print(std)
std.shape
std.size
std.dtypes
std.index
std.values
std.columns
std.ndim

   StudentID     Name  Age Department  Math  Science  English
0          1    Alice   20         CS    85       80       75
1          2      Bob   21         IT    78       85       88
2          3  Charlie   19         CS    92       70       82
3          4     None   22        ECE    65       60       70
4          5      Eva   20         IT    88       92       85
5          6    Frank   23         CS    74       75       80
6          7    Grace   21        ECE    90       88       90
7          8    Helen   20         IT    82       78       86
8          9      Ian   22         CS    95       85       84
9         10     Jane   19        ECE    70       72       73

2

In [51]:
# vector operations- we can perform some calculation on dataframe without using loops
#  - + / * **
# column wise
sls['total']=sls['Price']* sls['Quantity']

# element wise
d1=pd.DataFrame({'a':[1,2,3],'b':[4,5,6]})
d2=pd.DataFrame({'a':[10,20,30],'b':[40,50,60]})
print(d1)
print(d2)
print(d1+d2)
print(d1-d2)
print(d1/d2)
print(d1*d2)
print(d1**d2)

   a  b
0  1  4
1  2  5
2  3  6
    a   b
0  10  40
1  20  50
2  30  60
    a   b
0  11  44
1  22  55
2  33  66
    a   b
0  -9 -36
1 -18 -45
2 -27 -54
     a    b
0  0.1  0.1
1  0.1  0.1
2  0.1  0.1
    a    b
0  10  160
1  40  250
2  90  360
                 a                    b
0                1                    0
1          1048576 -6776596920136667815
2  205891132094649  1152921504606846976

In [64]:
# Aggregating functions- it is a function that perform some calculation on a set of values
# and returns a single value

# sum min max mean median count nunique
print(std)
std['Science'].nunique()
std['Science'].sum()
std['Science'].mean()
std['Science'].median()
std['Science'].min()
std['Science'].max()
std['Science'].count()

# how to appy mutliple aggregating functions
std['Science'].agg(['min','max'])

# how to apply aggregation function to the multiple columns
std[['Science','Math','English']].mean()

   StudentID     Name  Age Department  Math  Science  English
0          1    Alice   20         CS    85       80       75
1          2      Bob   21         IT    78       85       88
2          3  Charlie   19         CS    92       70       82
3          4     None   22        ECE    65       60       70
4          5      Eva   20         IT    88       92       85
5          6    Frank   23         CS    74       75       80
6          7    Grace   21        ECE    90       88       90
7          8    Helen   20         IT    82       78       86
8          9      Ian   22         CS    95       85       84
9         10     Jane   19        ECE    70       72       73

Science    78.5
Math       81.9
English    81.3
dtype: float64

In [69]:
# group by - it is used to split the data into groups and then perform aggregating functions

print(sls)
# product wise
sls.groupby('Product')['Price'].sum()

sls.groupby('Region')['Price'].sum()

# group by by multiple columns
sls.groupby(['Region','Product'])['Price'].sum()

   OrderID     Product     Category  Quantity  Price Region   total
0      101      Laptop  Electronics         2  60000  North  120000
1      102      Mobile  Electronics         5  20000  South  100000
2      103      Tablet  Electronics         3  15000   East   45000
3      104      Laptop  Electronics         1  62000   West   62000
4      105  Headphones  Accessories        10   2000  North   20000
5      106      Mobile  Electronics         4  21000  South   84000
6      107      Laptop  Electronics         2  61000   East  122000
7      108      Tablet  Electronics         6  15500   West   93000
8      109      Mobile  Electronics         7  20500  North  143500
9      110  Headphones  Accessories         8   2500   west   20000

Region  Product
East    Laptop        61000
        Tablet        15000
North   Headphones     2000
        Laptop        60000
        Mobile        20500
South   Mobile        41000
West    Laptop        62000
        Tablet        15500
west    Headphones     2500
Name: Price, dtype: int64